Tekla Open API Reference for Tekla Structures 2025
InputObjectDependencyAttribute Constructor (PluginBase.InputObjectDependency)
 The custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] uses this to store a dependency attribute which determines when the plug-in is updated in the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputObjectDependencyAttribute(
	PluginBase.InputObjectDependency Type
)
Public Sub New (
	Type As PluginBase.InputObjectDependency
)
Parameters
Type
Type: Tekla.Structures.Plugins.PluginBase.InputObjectDependency
The type of the input object dependency.
See Also
Reference
InputObjectDependencyAttribute Class
InputObjectDependencyAttribute Overload
Tekla.Structures.Plugins Namespace